Revit 2024 API
AssetPropertyEnum Class
 Represents a property of material.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public class AssetPropertyEnum : AssetProperty
Visual Basic
Public Class AssetPropertyEnum _
	Inherits AssetProperty
Visual C++
public ref class AssetPropertyEnum : public AssetProperty
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Visual.AssetProperty
 Autodesk.Revit.DB.Visual.AssetPropertyEnum
See Also
AssetPropertyEnum Members
Autodesk.Revit.DB.Visual Namespace